balazsgrill/modembed/res/Devices/dsPIC33/DSPIC33EP512GP806.PIC
        <edc:SFRDef edc:access="--------nnnnnnnn" edc:cname="DPCU" edc:desc="" edc:impl="0x0" edc:ishidden="true" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------00000000" edc:name="DPCU" edc:nzwidth="0x10" edc:por="--------00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="DPCU" edc:desc="" edc:islanghidden="true" edc:mask="0xff" edc:name="DPCU" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="56"/>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="DFTADD" edc:desc="" edc:impl="0xffff" edc:ishidden="true" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="DFTADD" edc:nzwidth="0x10" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="DFTADD" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="DFTADD" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="r" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="DFTDATA" edc:desc="" edc:impl="0xffff" edc:ishidden="true" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="DFTDATA" edc:nzwidth="0x10" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="DFTDATA" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="DFTDATA" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="r" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="DFTDATA_INC" edc:desc="" edc:impl="0xffff" edc:ishidden="true" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="DFTDATA_INC" edc:nzwidth="0x10" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="DFTDATA_INC" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="DFTDATA_INC" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="r" edc:stimtype="Integer"/>
        </edc:SFRDef>
      </edc:SFRDataSector>
      <edc:EmulatorSector edc:beginaddr="0xFD0000" edc:endaddr="0xfd0072" edc:regionid="emulreg"/>
      <edc:GPRDataSector edc:beginaddr="0x001000" edc:endaddr="0x00D000" edc:regionid="data"/>
      <edc:DPRDataSector edc:beginaddr="0xD000" edc:endaddr="0xE000" edc:regionid="dma"/>
      <edc:EDSWindowSector edc:beginaddr="0x8000" edc:endaddr="0x10000" edc:regionid="eds"/>
    </edc:RegardlessOfMode>
    <edc:TraditionalModeOnly/>
    <edc:ExtendedModeOnly/>
  </edc:DataSpace>
  <edc:PinList>
    <edc:Pin>
      <!--Pin 1-->
      <edc:VirtualPin edc:name="AN29"/>
      <edc:VirtualPin edc:name="PMD5"/>
      <edc:VirtualPin edc:name="RP85"/>
      <edc:VirtualPin edc:name="RE5"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 2-->
      <edc:VirtualPin edc:name="AN30"/>
      <edc:VirtualPin edc:name="PMD6"/>
      <edc:VirtualPin edc:name="RP86"/>
      <edc:VirtualPin edc:name="RE6"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 3-->
      <edc:VirtualPin edc:name="AN31"/>
      <edc:VirtualPin edc:name="PMD7"/>
      <edc:VirtualPin edc:name="RP87"/>
      <edc:VirtualPin edc:name="RE7"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 4-->
      <edc:VirtualPin edc:name="C1IND"/>
      <edc:VirtualPin edc:name="SCK2"/>
      <edc:VirtualPin edc:name="PMA5"/>
      <edc:VirtualPin edc:name="RP118"/>
      <edc:VirtualPin edc:name="RG6"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 5-->
      <edc:VirtualPin edc:name="C1INC"/>
      <edc:VirtualPin edc:name="SDI2"/>
      <edc:VirtualPin edc:name="PMA4"/>
      <edc:VirtualPin edc:name="RP119"/>
      <edc:VirtualPin edc:name="RG7"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 6-->
      <edc:VirtualPin edc:name="C2IND"/>
      <edc:VirtualPin edc:name="SDO2"/>
      <edc:VirtualPin edc:name="PMA3"/>
      <edc:VirtualPin edc:name="RP120"/>
      <edc:VirtualPin edc:name="RG8"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 7-->
      <edc:VirtualPin edc:name="MCLR"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 8-->
      <edc:VirtualPin edc:name="C2INC"/>
      <edc:VirtualPin edc:name="PMA2"/>
      <edc:VirtualPin edc:name="RP121"/>
      <edc:VirtualPin edc:name="RG9"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 9-->
      <edc:VirtualPin edc:name="Vss"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 10-->
      <edc:VirtualPin edc:name="Vdd"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 11-->
      <edc:VirtualPin edc:name="AN5"/>
      <edc:VirtualPin edc:name="C1INA"/>
      <edc:VirtualPin edc:name="RP37"/>
      <edc:VirtualPin edc:name="RB5"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 12-->
      <edc:VirtualPin edc:name="AN4"/>
      <edc:VirtualPin edc:name="C1INB"/>
      <edc:VirtualPin edc:name="RP36"/>
      <edc:VirtualPin edc:name="RB4"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 13-->
      <edc:VirtualPin edc:name="AN3"/>
      <edc:VirtualPin edc:name="C2INA"/>
      <edc:VirtualPin edc:name="RP35"/>
      <edc:VirtualPin edc:name="RB3"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 14-->
      <edc:VirtualPin edc:name="AN2"/>
      <edc:VirtualPin edc:name="C2INB"/>
      <edc:VirtualPin edc:name="RP34"/>
      <edc:VirtualPin edc:name="RB2"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 15-->
      <edc:VirtualPin edc:name="PGEC3"/>
      <edc:VirtualPin edc:name="AN1"/>
      <edc:VirtualPin edc:name="Vref-"/>
      <edc:VirtualPin edc:name="RP33"/>
      <edc:VirtualPin edc:name="RB1"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 16-->
      <edc:VirtualPin edc:name="PGED3"/>
      <edc:VirtualPin edc:name="AN0"/>
      <edc:VirtualPin edc:name="Vref+"/>
      <edc:VirtualPin edc:name="RP32"/>
      <edc:VirtualPin edc:name="RB0"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 17-->
      <edc:VirtualPin edc:name="PGEC1"/>
      <edc:VirtualPin edc:name="AN6"/>
      <edc:VirtualPin edc:name="RP38"/>
      <edc:VirtualPin edc:name="RB6"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 18-->
      <edc:VirtualPin edc:name="PGED1"/>
      <edc:VirtualPin edc:name="AN7"/>
      <edc:VirtualPin edc:name="RP39"/>
      <edc:VirtualPin edc:name="RB7"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 19-->
      <edc:VirtualPin edc:name="AVdd"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 20-->
      <edc:VirtualPin edc:name="AVss"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 21-->
      <edc:VirtualPin edc:name="AN8"/>
      <edc:VirtualPin edc:name="PMA6"/>
      <edc:VirtualPin edc:name="RP40"/>
      <edc:VirtualPin edc:name="RB8"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 22-->
      <edc:VirtualPin edc:name="AN9PMA7"/>
      <edc:VirtualPin edc:name="RP41"/>
      <edc:VirtualPin edc:name="RB9"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 23-->
      <edc:VirtualPin edc:name="TMS"/>
      <edc:VirtualPin edc:name="AN10"/>
      <edc:VirtualPin edc:name="CVref"/>
      <edc:VirtualPin edc:name="PMA13"/>
      <edc:VirtualPin edc:name="RP42"/>
      <edc:VirtualPin edc:name="RB10"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 24-->
      <edc:VirtualPin edc:name="TDO"/>
      <edc:VirtualPin edc:name="AN11"/>
      <edc:VirtualPin edc:name="PMA12"/>
      <edc:VirtualPin edc:name="RP43"/>
      <edc:VirtualPin edc:name="RB11"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 25-->
      <edc:VirtualPin edc:name="Vss"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 26-->
      <edc:VirtualPin edc:name="Vdd"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 27-->
      <edc:VirtualPin edc:name="TCK"/>
      <edc:VirtualPin edc:name="AN12"/>
      <edc:VirtualPin edc:name="PMA11"/>
      <edc:VirtualPin edc:name="RP44"/>
      <edc:VirtualPin edc:name="RB12"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 28-->
      <edc:VirtualPin edc:name="TDI"/>
      <edc:VirtualPin edc:name="AN13"/>
      <edc:VirtualPin edc:name="PMA10"/>
      <edc:VirtualPin edc:name="RP45"/>
      <edc:VirtualPin edc:name="RB13"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 29-->
      <edc:VirtualPin edc:name="AN14"/>
      <edc:VirtualPin edc:name="PMA1"/>
      <edc:VirtualPin edc:name="RP46"/>
      <edc:VirtualPin edc:name="RB14"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 30-->
      <edc:VirtualPin edc:name="AN15"/>
      <edc:VirtualPin edc:name="PMA0"/>
      <edc:VirtualPin edc:name="RP47"/>
      <edc:VirtualPin edc:name="RB15"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 31-->
      <edc:VirtualPin edc:name="SDA2"/>
      <edc:VirtualPin edc:name="PMA9"/>
      <edc:VirtualPin edc:name="RP100"/>
      <edc:VirtualPin edc:name="RF4"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 32-->
      <edc:VirtualPin edc:name="SCL2"/>
      <edc:VirtualPin edc:name="PMA8"/>
      <edc:VirtualPin edc:name="RP101"/>
      <edc:VirtualPin edc:name="RF5"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 33-->
      <edc:VirtualPin edc:name="RP99"/>
      <edc:VirtualPin edc:name="RF3"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 34-->
      <edc:VirtualPin edc:name="RP98"/>
      <edc:VirtualPin edc:name="RF2"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 35-->
      <edc:VirtualPin edc:name="RP102"/>
      <edc:VirtualPin edc:name="RF6"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 36-->
      <edc:VirtualPin edc:name="SDA1"/>
      <edc:VirtualPin edc:name="RG3"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 37-->
      <edc:VirtualPin edc:name="SCL1"/>
      <edc:VirtualPin edc:name="RG2"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 38-->
      <edc:VirtualPin edc:name="Vdd"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 39-->
      <edc:VirtualPin edc:name="OSC1"/>
      <edc:VirtualPin edc:name="RP60"/>
      <edc:VirtualPin edc:name="RC12"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 40-->
      <edc:VirtualPin edc:name="OSC2"/>
      <edc:VirtualPin edc:name="CLKO"/>
      <edc:VirtualPin edc:name="RC15"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 41-->
      <edc:VirtualPin edc:name="Vss"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 42-->
      <edc:VirtualPin edc:name="RTCC"/>
      <edc:VirtualPin edc:name="RP72"/>
      <edc:VirtualPin edc:name="RD8"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 43-->
      <edc:VirtualPin edc:name="ASDA1"/>
      <edc:VirtualPin edc:name="RP73"/>
      <edc:VirtualPin edc:name="RD9"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 44-->
      <edc:VirtualPin edc:name="ASCL1"/>
      <edc:VirtualPin edc:name="PMCS2"/>
      <edc:VirtualPin edc:name="RP74"/>
      <edc:VirtualPin edc:name="RD10"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 45-->
      <edc:VirtualPin edc:name="PMCS1"/>
      <edc:VirtualPin edc:name="RP75"/>
      <edc:VirtualPin edc:name="RD11"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 46-->
      <edc:VirtualPin edc:name="INT0"/>
      <edc:VirtualPin edc:name="RP64"/>
      <edc:VirtualPin edc:name="RD0"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 47-->
      <edc:VirtualPin edc:name="PGED2"/>
      <edc:VirtualPin edc:name="SOSCI"/>
      <edc:VirtualPin edc:name="C3IND"/>
      <edc:VirtualPin edc:name="RP61"/>
      <edc:VirtualPin edc:name="RC13"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 48-->
      <edc:VirtualPin edc:name="PGEC2"/>
      <edc:VirtualPin edc:name="SOSCO"/>
      <edc:VirtualPin edc:name="C3INC"/>
      <edc:VirtualPin edc:name="T1CK"/>
      <edc:VirtualPin edc:name="RP62"/>
      <edc:VirtualPin edc:name="RC14"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 49-->
      <edc:VirtualPin edc:name="Vcpcon"/>
      <edc:VirtualPin edc:name="RP65"/>
      <edc:VirtualPin edc:name="RD1"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 50-->
      <edc:VirtualPin edc:name="RP66"/>
      <edc:VirtualPin edc:name="RD2"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 51-->
      <edc:VirtualPin edc:name="PMBE"/>
      <edc:VirtualPin edc:name="RP67"/>
      <edc:VirtualPin edc:name="RD3"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 52-->
      <edc:VirtualPin edc:name="PMWR"/>
      <edc:VirtualPin edc:name="RP68"/>
      <edc:VirtualPin edc:name="RD4"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 53-->
      <edc:VirtualPin edc:name="PMRD"/>
      <edc:VirtualPin edc:name="RP69"/>
      <edc:VirtualPin edc:name="RD5"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 54-->
      <edc:VirtualPin edc:name="C3INB"/>
      <edc:VirtualPin edc:name="RP70"/>
      <edc:VirtualPin edc:name="RD6"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 55-->
      <edc:VirtualPin edc:name="C3INA"/>
      <edc:VirtualPin edc:name="RP71"/>
      <edc:VirtualPin edc:name="RD7"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 56-->
      <edc:VirtualPin edc:name="Vcap"/>
      <edc:VirtualPin edc:name="Vddcore"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 57-->
      <edc:VirtualPin edc:name="Vdd"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 58-->
      <edc:VirtualPin edc:name="RP96"/>
      <edc:VirtualPin edc:name="RF0"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 59-->
      <edc:VirtualPin edc:name="RP97"/>
      <edc:VirtualPin edc:name="RF1"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 60-->
      <edc:VirtualPin edc:name="AN24"/>
      <edc:VirtualPin edc:name="PMD0"/>
      <edc:VirtualPin edc:name="RP80"/>
      <edc:VirtualPin edc:name="RE0"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 61-->
      <edc:VirtualPin edc:name="AN25"/>
      <edc:VirtualPin edc:name="PMD1"/>
      <edc:VirtualPin edc:name="RP81"/>
      <edc:VirtualPin edc:name="RE1"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 62-->
      <edc:VirtualPin edc:name="AN26"/>
      <edc:VirtualPin edc:name="PMD2"/>
      <edc:VirtualPin edc:name="RP82"/>
      <edc:VirtualPin edc:name="RE2"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 63-->
      <edc:VirtualPin edc:name="AN27"/>
      <edc:VirtualPin edc:name="PMD3"/>
      <edc:VirtualPin edc:name="RP83"/>
      <edc:VirtualPin edc:name="RE3"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 64-->
      <edc:VirtualPin edc:name="AN28"/>
      <edc:VirtualPin edc:name="PMD4"/>
      <edc:VirtualPin edc:name="RP84"/>
      <edc:VirtualPin edc:name="RE4"/>
    </edc:Pin>
  </edc:PinList>
</edc:PIC>
